model {
  faster_rcnn {
    number_of_stages: 3
    num_classes: 2
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 320
        max_dimension: 700
	resize_method: BICUBIC
      }
    }
    feature_extractor {
      type: "faster_rcnn_inception_resnet_v2"
      first_stage_features_stride: 8
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        height_stride: 8
        width_stride: 8
        scales: 0.25
        scales: 0.5
        scales: 1.0
        scales: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 1.0
        aspect_ratios: 2.0
      }
    }
    first_stage_atrous_rate: 2
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.00999999977648
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.699999988079
    first_stage_max_proposals: 100
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 17
    maxpool_kernel_size: 1
    maxpool_stride: 1
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
        conv_hyperparams {
          op: CONV
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.00999999977648
            }
          }
        }
        predict_instance_masks: true
        mask_prediction_conv_depth: 0
        mask_height: 50
        mask_width: 50
        mask_prediction_num_conv_layers: 4
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.300000011921
        iou_threshold: 0.600000023842
        max_detections_per_class: 4
        max_total_detections: 4
      }
      score_converter: SOFTMAX
    }
    second_stage_batch_size: 50
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
    second_stage_mask_prediction_loss_weight: 4.0
  }
}
train_config {
  batch_size: 1
  batch_queue_capacity: 1
  num_batch_queue_threads: 1
  prefetch_queue_capacity: 1
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  optimizer {
    momentum_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.000300000014249
          schedule {
            step: 20000
            learning_rate: 2.99999992421e-05
          }
          schedule {
            step: 40000
            learning_rate: 3.00000010611e-06
          }
        }
      }
      momentum_optimizer_value: 0.899999976158
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/home/ilya/ai/kaggle/whales/input/pre-train-mask/model.ckpt"
  from_detection_checkpoint: true
#  num_steps: 50000
}
train_input_reader {
  label_map_path: "/home/ilya/ai/kaggle/whales/input/label_map.pbtxt"
  load_instance_masks: True
  mask_type: PNG_MASKS
  tf_record_input_reader {
    input_path: "/home/ilya/ai/kaggle/whales/input/w.tf"
  }
  prefetch_size: 2
  num_readers: 2
  min_after_dequeue: 1
}
eval_config {
  num_examples: 30
  max_evals: 8000
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "/home/ilya/ai/kaggle/whales/input/label_map.pbtxt"
  shuffle: false
  num_readers: 1
  load_instance_masks: True
  mask_type: PNG_MASKS
  tf_record_input_reader {
    input_path: "/home/ilya/ai/kaggle/whales/input/w.tf"
  }
}
